## 5.2. Применение функций и методов apply и map в Pandas


### Введение

Библиотека Pandas в Python предоставляет мощные инструменты для обработки и анализа данных. Одними из самых полезных функций являются `apply` и `map`, которые позволяют применять функции к элементам DataFrame или Series. В этом учебном пособии мы рассмотрим, как использовать эти методы.

In [1]:
# Импортируем библиотеку Pandas
import pandas as pd

### Создание DataFrame

Для начала, создадим простой DataFrame, с которым будем работать.

In [3]:
# Создание DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 70000, 80000]
})

# Просмотр DataFrame
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

### Использование метода apply

Метод `apply` можно использовать для применения функции вдоль оси DataFrame. 

#### Применение функции к столбцу

In [7]:
# Функция для вычисления 10% налога на зарплату
def calculate_tax(salary):
    return salary * 0.1

# Применение функции к столбцу 'Salary'
df['Tax'] = df['Salary'].apply(calculate_tax)

# Просмотр DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Salary  4 non-null      int64
 3   Tax     4 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 256.0+ bytes

#### Применение функции ко всему DataFrame

In [9]:
# Функция для вычисления среднего значения
def calculate_mean(column):
    return sum(column) / len(column)

# Применение функции только к числовым столбцам DataFrame
numerical_data = df.select_dtypes(include=['number'])
mean_values = numerical_data.apply(calculate_mean, axis=0)
mean_values

Age          32.5
Salary    65000.0
Tax        6500.0
dtype: float64

### Использование метода map

Метод `map` используется для замены каждого значения в Series с помощью функции или соответствующего значения из словаря или другой последовательности.

In [10]:
# Замена возрастов на категории
age_categories = {
    25: 'Young',
    30: 'Adult',
    35: 'Adult',
    40: 'Senior'
}

# Применение метода map к столбцу 'Age'
df['Age Category'] = df['Age'].map(age_categories)

# Просмотр DataFrame
df

      Name  Age  Salary     Tax Age Category
0    Alice   25   50000  5000.0        Young
1      Bob   30   60000  6000.0        Adult
2  Charlie   35   70000  7000.0        Adult
3    David   40   80000  8000.0       Senior

### Заключение

В этом учебном пособии мы рассмотрели, как использовать методы `apply` и `map` для применения функций к элементам DataFrame или Series в Pandas. Эти методы могут быть очень полезными для выполнения сложных операций с данными.